const GradeData = {
    "1학년": [
        { "이름": "철수", "성별": "남자", "국어": 98, "영어": 78, "수학": 88, "과학": 64 },
        { "이름": "민수", "성별": "남자", "국어": 92, "영어": 70, "수학": 76, "과학": 78 }
    ],
    "2학년": [
        { "이름": "영희", "성별": "여자", "국어": 88, "영어": 78, "수학": 62, "과학": 72 },
        { "이름": "하영", "성별": "여자", "국어": 78, "수학": 83, "과학": 91 },
        { "이름": "철호", "성별": "남자", "국어": 91, "영어": 98, "수학": 82, "과학": 76 }
    ],
    "3학년": [
        { "이름": "수현", "성별": "여자", "국어": 63, "영어": 60, "수학": 61 },
        { "이름": "철희", "성별": "남자", "국어": 82, "영어": 88, "수학": 80, "과학": 85 },
        { "이름": "민희", "성별": "남자", "국어": 95, "영어": 81, "수학": 90, "과학": 70 },
        { "이름": "수진", "성별": "남자", "국어": 91, "영어": 90, "수학": 95, "과학": 82 }
    ],
    "4학년": [
        { "이름": "호영", "성별": "남자", "국어": 88, "영어": 50, "과학": 88 }
    ],
};

export default GradeData;